Revit 2027 API
ExportPatternKey.OriginalFillPatternType Property
 The original FillPattern type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillPatternTarget OriginalFillPatternType { get; set; }
Public Property OriginalFillPatternType As FillPatternTarget
	Get
	Set
public:
property FillPatternTarget OriginalFillPatternType {
	FillPatternTarget get ();
	void set (FillPatternTarget value);
}
member OriginalFillPatternType : FillPatternTarget with get, set
Property Value
FillPatternTarget
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExportPatternKey Class
Autodesk.Revit.DB Namespace